app/views/incomes/edit.html.erb

        <%= fact.label :category %>
        <%= fact.collection_select "name", Category.all, :name, :name  %>
---
SELECT `categories`.* FROM `categories`