app/views/incomes/new.html.erb

        <%= fact.label :category %>
        <%= fact.collection_select "name", Category.all, :name, :name  %>
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`name` = 'Never' LIMIT 1