app/controllers/expenses_controller.rb

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` IN (3, 4)
SELECT `expenses`.* FROM `expenses` WHERE `expenses`.`user_id` = 1
---
  def index
    @expenses = current_user.expenses.includes(:category)

INSERT INTO `expenses` (`amount`, `user_id`, `created_at`, `updated_at`) VALUES (34567, 1, '2017-07-12 09:01:13', '2017-07-12 09:01:13')
---
  def create
    @expense = Expense.new(expense_params)

    respond_to do |format|
      if @expense.save

SELECT  `expenses`.* FROM `expenses` WHERE `expenses`.`id` = 1 AND `expenses`.`user_id` = 1 LIMIT 1
---
    def set_expense
      @expense = Expense.find_by(:id => params[:id], :user_id => current_user.id)