app/controllers/incomes_controller.rb

  def index
    require 'csv'
    @incomes = current_user.incomes.includes(:category)
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` IN (4, 3)
SELECT incomes.*, categories.name as category_name FROM `incomes` INNER JOIN `income_expense_category_mappings` ON `income_expense_category_mappings`.`categorized_id` = `incomes`.`id` AND `income_expense_category_mappings`.`categorized_type` = 'Income' INNER JOIN `categories` ON `categories`.`id` = `income_expense_category_mappings`.`category_id` WHERE `incomes`.`user_id` = 1

  def create
    @income = Income.new(income_params)

    respond_to do |format|
      if @income.save
---
INSERT INTO `incomes` (`amount`, `user_id`, `created_at`, `updated_at`) VALUES (1212, 1, '2017-07-11 13:44:37', '2017-07-11 13:44:37')

  def update
    respond_to do |format|
      if @income.update(income_params)
---
UPDATE `incomes` SET `amount` = 100, `updated_at` = '2017-07-11 14:07:17' WHERE `incomes`.`id` = 3

  def destroy
    @income.destroy
---
DELETE FROM `incomes` WHERE `incomes`.`id` = 3

    def set_income
      @income = Income.find_by(:id => params[:id], :user_id => current_user.id)
---
SELECT  `incomes`.* FROM `incomes` WHERE `incomes`.`id` = 6 AND `incomes`.`user_id` = 1 LIMIT 1