app/views/expenses/_form.html.erb

SELECT `categories`.* FROM `categories`
---
        <%= fact.label :category %>
        <%= fact.collection_select "name", Category.all, :name, :name  %>